---
title: AnalyticalPanel
classe: Autodesk.Revit.DB.Structure.AnalyticalPanel
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# AnalyticalPanel

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Thickness { get; set; }` | `analyticalPanel.Thickness` | Double |
| `AnalyticalPanel Create(Document, Curve, XYZ)` | `AnalyticalPanel.Create(document, profile, normal)` | AnalyticalPanel |
| `AnalyticalPanel Create(Document, CurveLoop)` | `AnalyticalPanel.Create(aDoc, curveLoop)` | AnalyticalPanel |
| `ISet<ElementId> GetAnalyticalOpeningsIds()` | `analyticalPanel.GetAnalyticalOpeningsIds()` | ISet<ElementId> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```